{
  "reviews": [
    {
      "car": "Audi A1",
      "rating": 1,
      "review": "Extremely disappointed with my Audi A1. The small cabin feels claustrophobic on longer drives, and the ride quality is surprisingly harsh for a premium brand. Road noise is excessive at highway speeds. For the price, this car offers very poor value compared to rivals.",
      "author": "Michael Thompson",
      "date": "2023-04-15"
    },
    {
      "car": "Audi A1",
      "rating": 2,
      "review": "The Audi A1 looks nice from outside but is a letdown to drive. Reliability has been poor with frequent electrical issues. The infotainment system freezes regularly and dealer service has been unhelpful. Expected much better quality from Audi.",
      "author": "Sarah Johnson",
      "date": "2023-06-22"
    },
    {
      "car": "Audi A1",
      "rating": 3,
      "review": "My Audi A1 is a mixed bag. The build quality and interior finishes are excellent, and it's easy to park in the city. However, the back seats are too cramped for adults, and the premium you pay for the badge doesn't quite translate to a premium driving experience.",
      "author": "David Wilson",
      "date": "2023-05-11"
    },
    {
      "car": "Audi A1",
      "rating": 4,
      "review": "Really enjoying my Audi A1. It's stylish, feels well-built and the fuel economy is excellent for daily commuting. The technology package is intuitive and the sound system surprisingly good for a small car. A joy to drive in urban environments.",
      "author": "Jennifer Lee",
      "date": "2023-07-03"
    },
    {
      "car": "Audi A1",
      "rating": 5,
      "review": "Absolutely love my Audi A1! Perfect city car with premium features and that coveted Audi badge. The interior feels much more upscale than competitors, and despite its small size, it handles beautifully on both city streets and highways. Best car purchase I've made.",
      "author": "Robert Chen",
      "date": "2023-03-29"
    },
    {
      "car": "Ford Focus",
      "rating": 1,
      "review": "My Ford Focus has been nothing but trouble since purchase. Transmission problems started at 20,000 miles, and Ford's customer service has been terrible. Interior materials feel cheap and wear out quickly. Deeply regret this purchase.",
      "author": "James Miller",
      "date": "2023-05-18"
    },
    {
      "car": "Ford Focus",
      "rating": 2,
      "review": "The Ford Focus lacks refinement in almost every area. Wind noise is excessive, the engine sounds coarse, and the seats become uncomfortable on longer journeys. The infotainment system is dated and glitchy. Would not recommend to friends or family.",
      "author": "Emily Parker",
      "date": "2023-04-02"
    },
    {
      "car": "Ford Focus",
      "rating": 3,
      "review": "The Ford Focus is decent for the price point. Handling is responsive and the fuel economy is good, but interior quality feels a bit below some competitors. Technology works but isn't particularly impressive. It's a practical choice that won't excite but won't disappoint either.",
      "author": "Thomas Brown",
      "date": "2023-06-14"
    },
    {
      "car": "Ford Focus",
      "rating": 4,
      "review": "Very happy with my Ford Focus. It offers exceptional handling for its class and the EcoBoost engine provides a good balance of performance and economy. The latest model has a much-improved interior and the safety features are comprehensive. Great value for money.",
      "author": "Lisa Martinez",
      "date": "2023-07-20"
    },
    {
      "car": "Ford Focus",
      "rating": 5,
      "review": "The Ford Focus exceeded all my expectations! Incredible driving dynamics make every journey enjoyable. The spacious interior and large trunk are perfect for family needs. Build quality is excellent and after 18 months, no mechanical issues whatsoever. A fantastic all-rounder.",
      "author": "Daniel Smith",
      "date": "2023-02-09"
    }
  ]
}